<?php 
/**
* @ Version: 2008.0
* @ Copyright: Copyright (C) 2006-2008 Elxis.org. All rights reserved.
* @ Package: Elxis
* @ Subpackage: Tools
* @ Author: Elxis Team
* @ Translator: Ioannis Sannos
* @ Translator URL: http://www.elxis.org
* # Translator E-mail: info@elxis.org
* @ Description: English language for Updiag tool (hashes help)
* @ License: http://www.gnu.org/copyleft/gpl.html GNU/GPL
* Elxis CMS is a Free Software
*
* ---- THIS FILE MUST BE ENCODED AS UTF-8! ----
*
*/

defined( '_VALID_MOS' ) or die( 'Direct Access to this location is not allowed.' );

?>

<p align="justify">Ένα hash είναι ένα μοναδικό ίχνος κάθε αρχείου. Αυτό το ίχνος αλλάζει αν το αρχείο 
τροποποιηθεί ακόμα και προσθέτοντας ένα κενό σε αυτό. Με αυτόν τον τρόπο μπορούμε να διαπιστώσουμε αν τα αρχεία που 
αποτελούν μία εγκατάσταση Elxis είναι ακέραια ή αν ξεχάσαμε να ενημερώσουμε κάποια αρχεία έπειτα από μία αναβάθμιση. 
Τα hash θα μας βοηθήσουν επίσης να επαναφέρουμε μία εγκατάσταση Elxis μετά από μία επίθεση hacker ή οτιδήποτε άλλο 
μπορεί να επηρεάσει το σύστημα των αρχείων του Elxis μας. Στο Elxis χρησιμοποιούμε έναν ιδιαίτερο τρόπο υπολογισμού 
των MD5 hashes. Έτσι για κάθε αρχείο του Elxis υπάρχουν δύο διαφορετικά hash. αν ο έλεγχος με βάση το πρώτο hash 
αποτύχει, τότε εκτελείται έλεγχος και με το δεύτερο. Αν και ο δεύτερος έλεγχος αποτύχει τότε το Elxis καταλαβαίνει 
πως αυτό το αρχείο έχει τροποποιηθεί.</p>

<p align="justify">Για κάθε έκδοση Elxis υπάρχουν 3 διαφορετικά αρχεία hash. Ένα <b>κανονικό</b> (ιδανικό 
για λειτουργικές ιστοσελίδες), ένα <b>εκτεταμένο</b> (ιδανικό για ιστοσελίδες ακριβώς από μετά μία καθαρή εγκατάσταση Elxis) 
και ένα <b>πλήρης</b> (μόνο χρήσιμο για ειδικές περιπτώσεις). <u>Θα πρέπει να χρησιμοποιείτε τον κανονικό αρχείο hash 
εναντίον λειτουργικών και online ιστοσελίδων.</u> Η <b>Ομάδα του Elxis</b> (Elxis Team) είναι η μόνη εξουσιοδοτημένη 
αρχή παραγωγής αυτών των αρχείων hash. Μην χρησιμοποιείτε αρχεία hash από μη-εξουσιοδοτημένες πηγές. Μην επεξεργάζεστε 
ή μετονομάζετε τα αρχεία hash. Μπορείτε να κατεβάσετε αρχεία hash για την έκδοση του Elxis σας από την ιστοσελίδα 
<a href="http://www.elxis.org" target="blank">elxis.org</a>.</p>

<p align="justify">Για να εγκαταστήσετε ένα αρχείο hash απλά ανεβάστε το στον κατάλογο των hash (/administrator/tool/updiag/data/hashes). 
Μπορείτε να εκτελέσετε έναν έλεγχο ακεραιότητα του συστήματος αρχείων οποιαδήποτε στιγμή, έναντι οποιουδήποτε 
εγκατεστημένου αρχείο hash που ταιριάζει στην έκδοση του Elxis σας πατώντας το κομβίο "Εκτέλεση".</p>
