<?php
	// ================================================
	// PHP image browser - iBrowser 
	// ================================================
	// iBrowser - language file: Greek
	// ================================================
	// Developed: net4visions.com
	// Copyright: net4visions.com
	// License: GPL - see license.txt
	// (c)2005 All rights reserved.
	// ================================================
	// Revision: 1.1                   Date: 07/07/2005
	// ================================================
	//	Greek translation by Ioannis Sannos (datahell@elxis.org)
	// ================================================
	//
	//-------------------------------------------------------------------------
	// charset to be used in dialogs
	$lang_charset = 'UTF-8';
	// text direction for the current language to be used in dialogs
	$lang_direction = 'ltr';
	//-------------------------------------------------------------------------
	
	// language text data array
	// first dimension - block, second - exact phrase
	//-------------------------------------------------------------------------
	// iBrowser
	$lang_data = array (  
		'ibrowser' => array (
		//-------------------------------------------------------------------------
		// common - im
		'im_001' => 'Περιηγητής εικόνων',
		'im_002' => 'iBrowser',
		'im_003' => 'Μενού',
		'im_004' => 'Καλώς ήρθατε',
		'im_005' => 'Εισαγωγή',
		'im_006' => 'Ακύρωση',
		'im_007' => 'Εισαγωγή',		
		'im_008' => 'Εισαγωγή/τροποποίηση',
		'im_009' => 'Ιδιότητες',
		'im_010' => 'Ιδιότητες εικόνας',
		'im_013' => 'Αναδυόμενο',
		'im_014' => 'Αναδυόμενο παράθυρο εικόνας',
		'im_015' => 'Σχετικά με τον iBrowser',
		'im_016' => 'Ενότητα',
		'im_097' => 'Φορτώνει, παρακαλούμε περιμένετε...',
		'im_098' =>	'Άνοιγμα ενότητας',
		'im_099' => 'Κλείσιμο ενότητας',
		//-------------------------------------------------------------------------
		// insert/change screen - in	
		'in_001' => 'Εισαγωγή/Τροποποίηση εικόνας',
		'in_002' => 'Βιβλιοθήκη',
		'in_003' => 'Επιλέξτε μία βιβλιοθήκη εικόνων',
		'in_004' => 'Εικόνες',
		'in_005' => 'Προεπισκόπιση',
		'in_006' => 'Διαγραφή εικόνας',
		'in_007' => 'Πατήστε για μεγαλύτερο μέγεθος της εικόνας',
		'in_008' => 'Άνοιγμα σταλθέντας εικόνας, μετονομασία ή διαγραφή ενότητας',	
		'in_009' => 'Πληροφορίες',
		'in_010' => 'Αναδυόμενο',		
		'in_013' => 'Δημιουργία ενός συνδέσμου προς μία εικόνα για άνοιγμα σε νέο παράθυρο.',
		'in_014' => 'αφαίρεση συνδέσμου αναδυόμενου',	
		'in_015' => 'Αρχείο',	
		'in_016' => 'Μετονομασία',
		'in_017' => 'Μετονομασία εικόνας',
		'in_018' => 'Αποστολή',
		'in_019' => 'Αποστολή εικόνας',
		'in_020' => 'Μέγεθος(οι)',
		'in_021' => 'Ελέγξτε ώστε τα προτιμώμενα μεγέθη να δημιουργηθούν κατά την αποστολή των εικόνων',
		'in_022' => 'Αυθεντική',
		'in_023' => 'Η εικόνα θα περικοπεί',
		'in_024' => 'Διαγραφή',
		'in_025' => 'Κατάλογος',
		'in_026' => 'Πατήστε για δημιουργία καταλόγου',
		'in_027' => 'Δημιουργία καταλόγου',
		'in_028' => 'Πλάτος',
		'in_029' => 'Ύψος',
		'in_030' => 'Τύπος',
		'in_031' => 'Μέγεθος',
		'in_032' => 'Όνομα',
		'in_033' => 'Δημιουργήθηκε',
		'in_034' => 'Τροποποιήθηκε',
		'in_035' => 'Πληροφορίες εικόνας',
		'in_036' => 'Πατήστε στην εικόνα για κλείσιμο του παραθύρου',
		'in_037' => 'Περιστροφή',
		'in_038' => 'Αυτόματη περιστροφή: επιλέξτε exif info, για να χρησιμοποιήσετε τον EXIF προσανατολισμό που έχει αποθηκευτεί στη κάμερα. Μπορεί επίσης να λάβει τιμές to +180&deg; ή -180&deg; για οριζόντιο προσανατολισμό, ή +90&deg; ή -90&deg; για κατακόρυφο. Θετικές τιμές για περιστροφή κατά τη φορά των δεικτών του ρολογιού και αρνητικές τιμές για αντίστροφη φορά.',
		'in_041' => '',
		'in_042' => 'κανένα',
		'in_043' => 'πορτραίτο',
		'in_044' => '+ 90&deg;',
		'in_045' => '- 90&deg;',
		'in_046' => 'τοπίο',
		'in_047' => '+ 180&deg;',
		'in_048' => '- 180&deg;',
		'in_049' => 'κάμερα',
		'in_050' => 'exif info',
		'in_051' => 'ΠΡΟΣΟΧΗ: Η τρέχουσα εικόνα είναι ένα δυναμικό thumbnail που έχει δημιουργηθεί από τον iManager. Οι παράμετροι θα χαθούν με την αλλαγή της εικόνας.',
		'in_052' => 'Κάντε κλικ για να αλλάξετε την επιλογή εμφάνισης',
		'in_053' => 'Τυχαία',
		'in_054' => 'Αν επιλεγεί θα εισαχθεί μία τυχαία εικόνα',
		'in_055' => 'Επιλέξτε για εισαγωγή τυχαίας εικόνας',
		'in_056' => 'Παράμετροι',
		'in_057' => 'κάντε κλικ για να αρχικοποιήσετε τις παραμέτρους στις εξ ορισμού τιμές',
		'in_099' => 'προκαθορισμένα',
		//-------------------------------------------------------------------------
		// properties, attributes - at
		'at_001' => 'Ιδιότητες εικόνας',
		'at_002' => 'Πηγή',
		'at_003' => 'Τίτλος',
		'at_004' => 'ΤΙΤΛΟΣ - εμφανίζει  την περιγραφή της εικόνας σε mouseover',
		'at_005' => 'Περιγραφή',
		'at_006' => 'ALT -  αντικατάσταση με κείμενο της εικόνας. Εμφανίζεται ή χρησιμοποιείται στη θέση της εικόνας όταν δεν είναι δυνατή η εμφάνισή της',
		'at_007' => 'Στυλ',
		'at_008' => 'Παρακαλούμε βεβαιωθείτε ότι το επιλεγμένο στυλ υπάρχει στο φύλλο δεδομένων CSS!',
		'at_009' => 'CSS-στυλ',
		'at_010' => 'Ιδιότητες',
		'at_011' => 'Οι ιδιότητες \'align\', \'border\', \'hspace\', και \'vspace\' του στοιχείου εικόνας, δεν υποστηρίζονται στο XHTML 1.0 Strict DTD. Αντί αυτών, παρακαλούμε χρησιμοποιήστε το CSS-στυλ.',
		'at_012' => 'Στοίχιση',
		'at_013' => 'προκαθορισμένη',
		'at_014' => 'αριστερά',
		'at_015' => 'δεξιά',
		'at_016' => 'κορυφή',
		'at_017' => 'μέση',
		'at_018' => 'πυθμένας',
		'at_019' => 'absmiddle',
		'at_020' => 'texttop',
		'at_021' => 'baseline',
		'at_022' => 'Μέγεθος',
		'at_023' => 'Πλάτος',
		'at_024' => 'Ύψος',
		'at_025' => 'Πλαίσιο',
		'at_026' => 'V-space',
		'at_027' => 'H-space',
		'at_028' => 'Προεπισκόπιση',
		'at_029' => 'Κάντε κλικ για να εισάγετε έναν ειδικό χαρακτήρα στο πεδίο του τίτλου',
		'at_030' => 'Κάντε κλικ για να εισάγετε έναν ειδικό χαρακτήρα στο πεδίο της περιγραφής',
		'at_031' => 'Αρχικοποίηση των διαστάσεων της εικόνας στις αρχικές τιμές',
		'at_032' => 'Λεζάντα',
		'at_033' => 'επιλεγμένο: ορισμός λεζάντας εικόνας / μη επιλεγμένο: χωρίς λεζάντα ή αφαίρεση της υπάρχουσας λεζάντας',
		'at_034' => 'ορισμός λεζάντας εικόνας',
		'at_099' => 'προκαθορισμένη',
		//-------------------------------------------------------------------------		
		// error messages - er
		'er_001' => 'Σφάλμα',
		'er_002' => 'Δεν επιλέχθηκε εικόνα!',
		'er_003' => 'Το Πλάτος δεν είναι αριθμός',
		'er_004' => 'Το Ύψος δεν είναι αριθμός',
		'er_005' => 'Το Πλαίσιο δεν είναι αριθμός',
		'er_006' => 'Η οριζόντια απόσταση δεν είναι αριθμός',
		'er_007' => 'Η κάθετη απόσταση δεν είναι αριθμός',
		'er_008' => 'Πατήστε ΟΚ για διαγραφή της εικόνας',
		'er_009' => 'Δεν επιτρέπεται η μετονομασία των thumbnails! Παρακαλούμε μετονομάστε την κύρια εικόνα εάν θέλετε να μετονομάσετε την εικόνα του thumbnail.',
		'er_010' => 'Πατήστε ΟΚ για μετονομασία της εικόνας σε ',
		'er_011' => 'Το νέο όνομα ή είναι κενό, ή δεν έχει αλλαχθεί!',
		'er_014' => 'Παρακαλούμε εισάγετε το όνομα του νέου αρχείου!',
		'er_015' => 'Παρακαλούμε εισάγετε ένα έγκυρο όνομα αρχείου!',
		'er_016' => 'Δεν είναι διαθέσιμη η δυνατότητα δημιουργία Thumbnail! Παρακαλούμε ορίστε το μέγεθος του thumbnail στο αρχείο config, ώστε να μπορέσει να χρησιμοποιηθεί αυτή η δυνατότητα.',
		'er_021' => 'Πατήστε ΟΚ για αποστολή της εικόνας(ων).',
		'er_022' => 'Αποστολή εικόνας - παρακαλώ περιμένετε...',
		'er_023' => 'Δεν έχει επιλεγεί καμία εικόνα ή δεν έχει επιλεγεί ένα μέγεθος εικόνας.',
		'er_024' => 'Το αρχείο',
		'er_025' => 'υπάρχει ήδη! Παρακαλούμε κάντε κλικ στο OK για να το αντικαταστήσετε...',
		'er_026' => 'Παρακαλούμε εισάγετε νέο όνομα αρχείου!',
		'er_027' => 'Ο φάκελος δεν υπάρχει',
		'er_028' => 'Συνέβει ένα σφάλμα κατά την αποστολή του αρχείου. Παρακαλούμε προσπαθήστε ξανά.',
		'er_029' => 'Λάθος τύπος αρχείου εικόνας',
		'er_030' => 'Η διαγραφή απέτυχε! Παρακαλούμε προσπαθήστε ξανά.',
		'er_031' => 'Αντικατάσταση',
		'er_032' => 'Η προεπισκόπηση πλήρους μεγέθους, λειτουργεί μόνο εικόνες μεγαλύτερες από το μέγεθος προεπισκόπησης',
		'er_033' => 'Η μετονομασία του αρχείου απέτυχε! Παρακαλούμε προσπαθήστε ξανά.',
		'er_034' => 'Η δημιουργία καταλόγου απέτυχε! Παρακαλούμε προσπαθήστε ξανά.',
		'er_035' => 'Η μεγέθυνση δεν επιτρέπεται!',
		'er_036' => 'Σφάλμα δημιουργίας λίστας εικόνων!',
	  ),	  
	  //-------------------------------------------------------------------------
	  // symbols
		'symbols'		=> array (
		'title' 		=> 'Σύμβολα',
		'ok' 			=> 'Εντάξει',
		'cancel' 		=> 'Άκυρο',
	  ),	  
	)
?>
