<?php
	// ================================================
	// PHP image browser - iBrowser 
	// ================================================
	// iBrowser - language file: Persian
	// ================================================
	// Developed: net4visions.com
	// Copyright: net4visions.com
	// License: GPL - see license.txt
	// (c)2005 All rights reserved.
	// ================================================
	// Revision: 1.1                   Date: 07/07/2005
	// ================================================
	
	//-------------------------------------------------------------------------
	// charset to be used in dialogs
	$lang_charset = 'UTF-8';
	// text direction for the current language to be used in dialogs
	$lang_direction = 'rtl';
	//-------------------------------------------------------------------------
	
	// language text data array
	// first dimension - block, second - exact phrase
	//-------------------------------------------------------------------------
	// iBrowser
	$lang_data = array (  
		'ibrowser' => array (
		//-------------------------------------------------------------------------
		// common - im
		'im_001' => 'مرورگر تصویر',
		'im_002' => 'iBrowser',
		'im_003' => 'منو',
		'im_004' => 'خوش آمدید',
		'im_005' => 'درج',
		'im_006' => 'لغو',
		'im_007' => 'درج',		
		'im_008' => 'درج/تغییر',
		'im_009' => 'مشخصات',
		'im_010' => 'مشخصات تصویر',
		'im_013' => 'پنجره بازشو',
		'im_014' => 'تصویر پنجره بازشو',
		'im_015' => 'درباره iBrowser',
		'im_016' => 'بخش',
		'im_097' => 'لطفا تا هنگام بارگذاری منتظر بمانید...',
		'im_098' =>	'بازکردن بخش',
		'im_099' => 'بستن بخش',
		//-------------------------------------------------------------------------
		// insert/change screen - in	
		'in_001' => 'درج/تغییر تصویر',
		'in_002' => 'کتابخانه',
		'in_003' => 'یک کتابخانه تصویر را انتخاب نمائید',
		'in_004' => 'تصاویر',
		'in_005' => 'پیش نمایش',
		'in_006' => 'حذف تصویر',
		'in_007' => 'جهت نمایش بزرگتر تصویر کلیک نمائید',
		'in_008' => 'بازکردن آپلود تصویر ، تغییر نام ، یا حذف بخش',	
		'in_009' => 'اطلاعات',
		'in_010' => 'پنجره باز شو',		
		'in_013' => 'ایجاد یک لینک به یک تصویر جهت از شدن در یک پنجره جدید.',
		'in_014' => 'حذف لینک پنجره بازشو',	
		'in_015' => 'فایل',	
		'in_016' => 'تغییر نام',
		'in_017' => 'تغییر نام تصویر',
		'in_018' => 'آپلود',
		'in_019' => 'آپلود تصویر',	
		'in_020' => 'اندازه(ها)',
		'in_021' => 'اندازه(های) مورد نظر خود را بررسی نمائید تا در هنگام آپلود تصویر (تصاویر) ایجاد شوند',
		'in_022' => 'اصلی',
		'in_023' => 'تصویر چیده خواهد شد',
		'in_024' => 'حذف',
		'in_025' => 'فهرست',
		'in_026' => 'جهت ایجاد یک فهرست کلیک نمائید',
		'in_027' => 'ایجاد یک فهرست',
		'in_028' => 'پهنا',
		'in_029' => 'ارتفاع',
		'in_030' => 'نوع',
		'in_031' => 'اندازه',
		'in_032' => 'نام',
		'in_033' => 'ایجاد شده',
		'in_034' => 'اصلاح شده',
		'in_035' => 'اطلاعات تصویر',
		'in_036' => 'جهت بسته شدن پنجره بر روی تصویر کلیک نمائید',
		'in_037' => 'چرخش',
		'in_038' => 'چرخش اتوماتیک: تنظیم به اطلاعات exif ، جهت استفاده از گرایش EXIF ذخیره شده توسط دوربین. همچنین می تواند به +180&deg; یا -180&deg; برای دورنما ، یا +90&deg; یا -90&deg; برای تصویر کردن تنظیم شود. مقادیر مثبت برای ساعت چرخ و مقادیر منفی برای خلاف ساعت چرخ.',
		'in_041' => '',
		'in_042' => 'هیچ کدام',		
		'in_043' => 'portrait',
		'in_044' => '+ 90&deg;',	
		'in_045' => '- 90&deg;',
		'in_046' => 'landscape',	
		'in_047' => '+ 180&deg;',	
		'in_048' => '- 180&deg;',
		'in_049' => 'دوربین',	
		'in_050' => 'اطلاعات exif',
		'in_051' => 'هشدار: تصویر کنونی یک تصویر کوچک ایجاد شده توسط iManager می باشد - پارامتر ها در هنگام تغییر تصویر از دست خواهند رفت.',
		'in_052' => 'جهت تعویض مشاهده انتخاب تصویر کلیک نمائید',
		'in_053' => 'تصادفی',
		'in_054' => 'اگر انتخاب شده باشد ، تصویر تصادفی درج خواهد شد',
		'in_055' => 'جهت درج تصویر تصادفی انتخاب نمائید',
		'in_056' => 'پارامتر ها',
		'in_057' => 'جهت تنظیم مجدد پارامتر ها به مقادیر پیشفرض کلیک نمائید',
		'in_099' => 'پیشفرض',	
		//-------------------------------------------------------------------------
		// properties, attributes - at
		'at_001' => 'صفات تصویر',
		'at_002' => 'منبع',
		'at_003' => 'عنوان',
		'at_004' => 'عنوان - در هنگام بالا آمدن موس توضیح تصویر را نمایش می دهد',
		'at_005' => 'توضیح',
		'at_006' => 'ALT -  تعویض متنی برای تصویر ، جهت نمایش یا در صورت عدم استفاده جهت قرارگیری به جای تصویر',
		'at_007' => 'استیل',
		'at_008' => 'لطفا از وجود استیل انتخاب شده در ورقه استیل خود مطمئن شوید!',
		'at_009' => 'استیل-CSS',	
		'at_010' => 'صفات',
		'at_011' => 'صفات \'align\' ، \'border\' ، \'hspace\' ، و \'vspace\' از عنصر تصویر در XHTML 1.0 Strict DTD پشتیبانی نمی شوند. لطفا از استیل-CSS به جای آنها استفاده نمائید.',
		'at_012' => 'تراز',	
		'at_013' => 'پیشفرض',
		'at_014' => 'چپ',
		'at_015' => 'راست',
		'at_016' => 'بالا',
		'at_017' => 'وسط',
		'at_018' => 'پایین',
		'at_019' => 'وسط مطلق',
		'at_020' => 'متن بالا',
		'at_021' => 'خط پایه',		
		'at_022' => 'اندازه',
		'at_023' => 'پهنا',
		'at_024' => 'ارتفاع',
		'at_025' => 'حاشیه',
		'at_026' => 'فاصله عمودی',
		'at_027' => 'فاصله افقی',
		'at_028' => 'پیش نمایش',	
		'at_029' => 'جهت وارد کردن کاراکتر مخصوص در داخل فیلد عنوان کلیک نمائید',
		'at_030' => 'جهت وارد کردن کاراکتر مخصوص در داخل فیلد توضیح کلیک نمائید',
		'at_031' => 'تنظیم مجدد ابعاد تصویر به مقادیر پیشفرض',
		'at_032' => 'عنوان',
		'at_033' => 'انتخاب شده: تنظیم عنوان تصویر / انتخاب نشده: عدم تنظیم عنوان تصویر یا حذف عنوان تصویر',
		'at_034' => 'تنظیم عنوان تصویر',
		'at_099' => 'پیشفرض',	
		//-------------------------------------------------------------------------		
		// error messages - er
		'er_001' => 'خطا',
		'er_002' => 'هیچ تصویری انتخاب نشده است!',
		'er_003' => 'پهنا یک عدد نیست',
		'er_004' => 'ارتفاع یک عدد نیست',
		'er_005' => 'حاشیه یک عدد نیست',
		'er_006' => 'فضای افقی یک عدد نیست',
		'er_007' => 'فضای عمودی یک عدد نیست',
		'er_008' => 'جهت حذف تصویر بر روی تایید کلیک نمائید',
		'er_009' => 'تغییر نام تصاویر کوچک مجاز نمی باشد! لطفا اگر مایل هستید تا نام تصویر کوچک را تغییر دهید ، نام تصویر اصلی را تغییر دهید.',
		'er_010' => 'بر روی تایید کلیک نمائید جهت تغییر نام تصویر به',
		'er_011' => 'نام جدید یا خالی می باشد یا تغییر نکرده است!',
		'er_014' => 'لطفا نام جدید فایل را وارد نمائید!',
		'er_015' => 'لطفا نام فایل معتبر را وارد نمائید!',
		'er_016' => 'کوچک سازی تصاویر در دسترس نمی باشد! لطفا اندازه تصویر کوچک را در فایل پیکربندی تنظیم نمائید تا کوچک سازی فعال شود.',
		'er_021' => 'جهت آپلود تصویر(تصاویر) بر روی تایید کلیک نمائید.',
		'er_022' => 'در حال آپلود کردن تصویر - لطفا منتظر بمانید...',
		'er_023' => 'هیچ تصویری انتخاب نشده است یا هیچ اندازه فایلی انتخاب نشده است.',
		'er_024' => 'فایل',
		'er_025' => 'در حال حاضر موجود است! لطفا جهت رونویسی فایل بر روی تایید کلیک نمائید...',
		'er_026' => 'لطفا نام فایل جدید را وارد نمائید!',
		'er_027' => 'فهرست به صورت فیزیکی وجود ندارد',
		'er_028' => 'خطایی در هنگام رسیدگی به آپلود فایل رخ داد. لطفا مجددا سعی نمائید.',
		'er_029' => 'نوع فایل تصویر اشتباه',
		'er_030' => 'حذف نا موفق شد! لطفا مجددا سعی نمائید.',
		'er_031' => 'رونویسی',
		'er_032' => 'پیش نمایش اندازه کامل فقط برای تصاویر بزرگتر از اندازه پیش نمایش کار می کند',
		'er_033' => 'تغییر نام فایل ناموفق شد! لطفا مجددا سعی نمائید.',
		'er_034' => 'ایجاد فهرست ناموفق شد! لطفا مجددا سعی نمائید.',
		'er_035' => 'بزرگنمایی مجاز نمی باشد!',
		'er_036' => 'خطا در ایجاد لیست تصویر!',
	  ),	  
	  //-------------------------------------------------------------------------
	  // symbols
		'symbols'		=> array (
		'title' 		=> 'سمبل ها',
		'ok' 			=> 'تایید',
		'cancel' 		=> 'لغو',
	  ),	  
	)

//-- ترجمه توسط فرهاد سخایی farhad0@gmail.com www.portalha.com
?>