<?php 

/* Easy Slider module v.1.2 for Elxis CMS
*  Copyright (C) 2011 www.osw.gr - All rights reserved.
*  Licence GNU/GPL
*  
*  Based on jQuery plugin written by Alen Grakalic (http://cssglobe.com/post/5780/easy-slider-17-numeric-navigation-jquery-slider)
*
* ---- THIS FILE MUST BE ENCODED AS UTF-8! ----
*
*/

defined( '_VALID_MOS' ) or die( 'Direct Access to this location is not allowed.' );

define('CX_MODEASY_DESC','
  <p align="justify">O <strong>Easy Slider</strong> είναι ένα jQuery plugin που δημιουργήθηκε από τον Alen Grakalic	<a href="http://cssglobe.com/post/5780/easy-slider-17-numeric-navigation-jquery-slider" target="_blank">
  (http://cssglobe.com/post/5780/easy-slider-17-numeric-navigation-jquery-slider)</a>.<br /><br /><strong> Εδώ παρουσιάζεται μια ελεύθερη έκδοση module για το Elxis CMS</strong> μέσω της οποίας μπορείτε να κυλήσετε οριζόντια ή 
  κατακόρυφα έως και 12 αντικείμενα περιεχομένου που μπορούν να έχουν τίτλο, εικόνα, εναλλακτικό κείμενο εικόνας, κυρίως κείμενο και (εσωτερικό ή εξωτερικό) σύνδεσμο του τύπου "Διαβάστε περισσότερα...".<br /><br />
  Στην τελευταία έκδοση 1.2 προστέθηκαν νέες λειτουργίες που περιγράφονται ακολούθως, καθώς και δυνατότητα ταυτόχρονης εμφάνισης διπλού slider, με διαφορετικές ρυθμίσεις έκαστος, π.χ. ένα slider οριζόντιας κύλησης και ένα κατακόρυφης.
  Ανάλογα της θέσης module που θα επιλέξετε να εμφανισθεί o slider, του πλάτους του περιέκτη των εικόνων (αν υπάρχουν και ορισθούν), του πλήθους γραμμών του κειμένου, καθώς και του προσανατολισμού κύλησης (οριζόντια ή κατακόρυφα), 
  πρέπει να ορίσετε τo ανάλογo πλάτος και ύψος του slider. Για να ορίσετε εικόνες, πρέπει να δημιουργήσετε εντός του φακέλου images της εγκατάστασης του Elxis, ένα φάκελλο με το όνομα easyslider και να φορτώσετε εκεί τις σχετικές 
  εικόνες. Στην παράμετρο "πλάτος περιέκτη εικόνας" προτείνεται όπως θέτετε απόλυτη τιμή αυξημένη κατά 10, σε σχέση με το πλάτος της κάθε εικόνας, ώστε να δημιουργείται μια απόσταση 10px μεταξύ εικόνας και κειμένου. Αν δεν θέλετε 
  να εμφανίσετε εικόνα σε κάποιο αντικείμενο, επιλέξτε - Να μην χρησιμοποιηθεί εικόνα - και θα εμφανισθεί μόνο το κείμενο, καταλαμβάνοντας το πλήρες πλάτος του περιέκτη του slider. Μπορείτε επίσης να εμφανίσετε μόνο εικόνα, αρκεί 
  να μην εισάγετε καθόλου κείμενο. Αν εισάγετε μόνο τίτλο και σύνδεσμο, τότε αυτός εφαρμόζεται επί του τίτλου. Αν εισάγετε μόνο εικόνα και σύνδεσμο, τότε αυτός εφαρμόζεται επί της εικόνας. Αν εισάγετε τίτλο, εικόνα και σύνδεσμο, 
  τότε αυτός εφαρμόζεται και επί του τίτλου καθώς και επί της εικόνας. Αν εισάγετε τίτλο, εικόνα, κείμενο και σύνδεσμο, τότε αυτός εφαρμόζεται και επί του τίτλου καθώς επίσης και επί της φράσης του τύπου "Διαβάστε περισσότερα...". 
  Στην περίπτωση του συνδέσμου σε εικόνα, μπορείτε σαν κείμενο (on mouse over) να εμφανίσετε είτε ότι εισάγετε στο πεδίο "Εναλλακτικό κείμενο εικόνας" είτε αυτόματα την φράση του τύπου "Διαβάστε περισσότερα..." αν αφήσετε κενό το
  πεδίο "Εναλλακτικό κείμενο εικόνας". Όσον αφορά τα στοιχεία (Τίτλος, Εικόνα, Κείμενο, Σύνδεσμος) και τις ρυθμίσεις των για κάθε κυλιόμενο αντικείμενο περιεχομένου, αυτά είναι αυτόνομα και κανένα δεν προαπαιτεί την ύπαρξη των 
  υπολοίπων για να εμφανισθεί.<br /><br /> Ο Easy Slider είναι συμβατός με τις εκδόσεις Elxis 2008.x και 2009.x καθώς και με PHP 5.x και εμφανίζεται το ίδιο καλά σε όλους τους μοντέρνους Browsers. Επίσης είναι συμβατός με γλώσσες RTL, 
  μόνο για κατακόρυφη κύληση. Τέλος, παρότι χρησιμοποιεί jQuery, μπορεί να χρησιμοποιηθεί ταυτόχρονα, χωρίς javascript conflict, με άλλες εφαρμογές που χρησιμοποιούν παρόμοια javascript, όπως με το IOS Gallery, IOS Downloads, IOS eshop κ.α.<br /><br />
  <strong>Παράμετροι ρυθμίσεων του Easy Slider</strong><br /><br />
  1.  Πλάτος - Ύψος<br />
  2.  Χρώμα φόντου<br />
  3.  Προσανατολισμός κύλησης (οριζόντια ή κατακόρυφα)<br />
  4.  Ταχύτητα κύλησης<br />
  5.  Χρόνος παύσης κύλησης<br />
  6.  Αυτόματη κύληση<br />
  7.  Συνεχής κύληση<br />
  8.  Μερική και επιλεκτική εμφάνιση μεταξύ των 12 αντικειμένων περιεχομένου<br />
  9.  Ρυθμίσεις εμφάνισης των στοιχείων (Τίτλος, Εικόνα, Εναλλακτικό κείμενο εικόνας, Κείμενο, Σύνδεσμος) κάθε αντικειμένου περιεχομένου<br />
  10. Πλοήγηση με βέλη ή αριθμούς<br />
  11. Εμφάνιση ή απόκρυψη πλοήγησης<br /><br />
  
  <strong>Εγχειρίδιο</strong>: <a href="http://wiki.elxis.org/wiki/Easy_Slider/el" target="_blank">http://wiki.elxis.org/wiki/Easy_Slider/el</a><br /><br />
  Easy Slider module v. 1.2 για το Elxis CMS: Copyright (C) 2011 <a href="http://www.osw.gr" target="_blank">http://www.osw.gr</a> - All rights reserved - Licence GNU/GPL</p>');
define('CX_MODEASY_CTRL','Ρυθμίσεις Easy Slider');
define('CX_MODEASY_ORIENT','Προσανατολισμός κύλησης');
define('CX_MODEASY_ORIENT_DESC','Επιλέξτε προσανατολισμό κύλησης (Οριζόντια ή Κατακόρυφα) (Τιμή εξ ορισμού: Οριζόντια).');
define('CX_MODEASY_HOR','Οριζόντια');
define('CX_MODEASY_VER','Κατακόρυφα');
define('CX_MODEASY_SPEED','Ταχύτητα κύλησης σε milliseconds');
define('CX_MODEASY_SPEED_DESC','Επιλέξτε τιμή ταχύτητας κύλησης. Όσο αυξάνεται η απόλυτη τιμή, τόσο μειώνεται η ταχύτητα κύλησης (Τιμή εξ ορισμού: 800).');
define('CX_MODEASY_AUTO','Αυτόματη κύληση');
define('CX_MODEASY_AUTO_DESC','Επιλέξτε αν θέλετε αυτόματη ή χειροκίνητη κύληση (Τιμή εξ ορισμού: Ναι - Αυτόματη).');
define('CX_MODEASY_PAUSE','Παύση κύλησης σε miliseconds');
define('CX_MODEASY_PAUSE_DESC','Επιλέξτε τιμή παύσης κύλησης. Η παράμετρος αυτή τίθεται σε milliseconds και δείχνει την διάρκεια κάθε κύλησης όταν επιλέγουμε αυτόματη κύληση. (Τιμή εξ ορισμού: 2000).');
define('CX_MODEASY_CONT','Συνεχής κύληση');
define('CX_MODEASY_CONT_DESC','Επιλέξτε αν θέλετε συνεχή κύληση (Τιμή εξ ορισμού: Ναι - Συνεχής).');
define('CX_MODEASY_NUM','Πλοήγηση με αριθμούς ή βέλη');
define('CX_MODEASY_NUM_DESC','Επιλέξτε αν θέλετε να εμφανίζονται αριθμοί ή βέλη στην πλοήγηση (Τιμή εξ ορισμού: Αριθμοί).');
define('CX_MODEASY_NUMBERS','Αριθμοί');
define('CX_MODEASY_ARROWS','Βέλη');
define('CX_MODEASY_NUMSLIDES','Αριθμός κυλιόμενων αντικειμένων');
define('CX_MODEASY_NUMSLIDES_DESC','Επιλέξτε αριθμό κυλιόμενων αντικειμένων (Τιμή εξ ορισμού: 3).');
define('CX_MODEASY_CTRLSHOW','Εμφάνιση πλοήγησης');
define('CX_MODEASY_CTRLSHOW_DESC','Επιλέξτε αν θέλετε να εμφανίζονται ή να αποκρύπτονται τα βέλη ή οι αριθμοί πλοήγησης (Τιμή εξ ορισμού: Ναι).');
define('CX_MODEASY_SLW','Πλάτος slider σε pixels');
define('CX_MODEASY_SLW_DESC','Θέσατε απόλυτη τιμή πλάτους του slider. Σημειώνεται ότι το πλάτος μπορεί να πάρει τιμές από 100 έως και 970 ενώ δεν μπορεί να πάρει τιμές % (Τιμή εξ ορισμού: 190).');
define('CX_MODEASY_SLH','Ύψος slider σε pixels');
define('CX_MODEASY_SLH_DESC','Θέσατε απόλυτη τιμή ύψους του slider. Σημειώνεται ότι το ύψος μπορεί να πάρει τιμές από 50 έως και 600 ενώ δεν μπορεί να πάρει τιμές % (Τιμή εξ ορισμού: 260).');
define('CX_MODEASY_BGCLR','Χρώμα φόντου');
define('CX_MODEASY_BGCLR_DESC','Ορίστε χρώμα φόντου για τον slider (Τιμή εξ ορισμού: transparent δηλ. διάφανο).');
define('CX_MODEASY_CONTITS','Αντικείμενα περιεχομένου');
define('CX_MODEASY_LIST','Εμφάνιση αντικειμένου περιεχομένου');
define('CX_MODEASY_LIST_DESC','Επιλέξτε αν θα εμφανίσετε ή όχι το αντικείμενο περιεχομένου (Τιμή εξ ορισμού: Όχι).');
define('CX_MODEASY_IMG','Εικόνα');
define('CX_MODEASY_IMG_DESC','Επιλέξτε εικόνα (Τιμή εξ ορισμού: Να μην χρησιμοποιηθεί εικόνα).');
define('CX_MODEASY_CIMGW','Πλάτος περιέκτη εικόνας σε pixels');
define('CX_MODEASY_CIMGW_DESC','Θέσατε απόλυτη τιμή πλάτους περιέκτη εικόνας. Προτείνεται όπως θέτετε απόλυτη τιμή αυξημένη κατά 10, ώστε να δημιουργείται μια απόσταση 10px μεταξύ εικόνας και κειμένου. (Τιμή εξ ορισμού: 130)');
define('CX_MODEASY_TITLE','Τίτλος');
define('CX_MODEASY_TITLE_DESC','Εισάγετε τον τίτλο του αντικειμένου περιεχομένου');
define('CX_MODEASY_ALT','Εναλλακτικό κείμενο εικόνας');
define('CX_MODEASY_ALT_DESC','Εισάγετε εναλλακτικό κείμενο εικόνας');
define('CX_MODEASY_TEXT','Κείμενο');
define('CX_MODEASY_TEXT_DESC','Εισάγετε το κείμενο του αντικειμένου περιεχομένου');
define('CX_MODEASY_LINK','Σύνδεσμος (Διαβάστε περισσότερα...)');
define('CX_MODEASY_LINK_DESC','Εισάγετε τον σύνδεσμο για το Διαβάστε περισσότερα...');
define('CX_MODEASY_TARGET','Στόχος συνδέσμου');
define('CX_MODEASY_TARGET_DESC','Επιλέξτε στόχο του συνδέσμου (Τιμή εξ ορισμού: Εσωτερικός).');
define('CX_MODEASY_SELF','Εσωτερικός (Ίδιο παράθυρο)');
define('CX_MODEASY_BLANK','Εξωτερικός (Νέο παράθυρο)');
?>