<?php
/*********************************************

*
**** ATTENTION: THIS FILE IS UTF-8 ENCODED! *****
*
*********************************************/

defined( '_VALID_MOS' ) or die( 'Direct Access to this location is not allowed.' );


//MODULE XML PARAMS
if (defined('_ELXIS_ADMIN')) {
    define('CX_01a', 'Τύπος μενού');  
    define('CX_01', 'Λίστα μενού προς εμφάνιση (χωρισμένα μεταξύ τους μεν κόμμα)Menu');
    define('CX_02', '[Επιλογή από]');
    define('CX_03', 'Λίστα μενού (δεν χρησιμοποιείται, μόνο για αναφορά!)');
    define('CX_04', 'Βάση');
    define('CX_05', 'Τι να χρησιμοποιηθεί ως βάση του κάθε δέντρου μενού; Επιλογές: πρώτο, μενού, module, ιστοσελίδα, κείμενο');
    define('CX_06', 'πρώτο');
    define('CX_07', 'μενού');
    define('CX_08', 'module');
    define('CX_09', 'ιστοσελίδα');
    define('CX_10', 'κείμενο');
    define('CX_11', 'Κείμενο βάσης');
    define('CX_12', 'Αν Βάση=κείμενο, ορίστε το κείμενο που θα χρησιμοποιηθεί');
    define('CX_13', 'Διαχωριστής');
    define('CX_14', 'Εκ προεπιλογής εμφανίζεται μία επικεφαλίδα μενού (αν Εμφάνιση τίτλου = Ναι στις ρυθμίσεις του module), μπορεί να οριστεί σε άλλο html κώδικα');
    define('CX_15', 'Ανάπτυξη όλων');
    define('CX_16', 'Εκ προεπιλογής ένα δέντρο μενού εμφανίζεται με όλους τους κόμβους συμπτιγμένους εκτούς του επιλεγμένου. Με αυτή την παράμετρο όλοι οι κόμβοι εμφανίζονται αναπτυγμένοι. Υπερκαλύπτει το Σύμπτιξη Ιδίου Επιπέδου');
    define('CX_true', 'Αληθές');
    define('CX_false', 'Ψευδές');
    define('CX_17', 'Χρήση επιλογής');
    define('CX_18', 'Οι κόμβοι μπορούν να επιλεχθούν (highlighted).');
    define('CX_19', 'Χρήση γραμμών');
    define('CX_20', 'Το δέντρο εμφανίζεται με γραμμές.');
    define('CX_21', 'Χρήση εικόνων');
    define('CX_22', 'Το δέντρο εμφανίζεται με εικονίδια.');
    define('CX_23', 'Χρήση κειμένου κατάστασης');
    define('CX_24', 'Εμφανίζει τα ονόματα των κόμβων στη γραμμή κατάστασης αντί για την url.');
    define('CX_25', 'Σύμπτιξη ιδίου επιπέδου');
    define('CX_26', 'Μόνο ένας κόμβος εντός ενός γονικού μπορεί να αναπτυχθεί κάθε φορά.');
}

?>