<?php
/*********************************************

*
**** ATTENTION: THIS FILE IS UTF-8 ENCODED! *****
*
*********************************************/

defined( '_VALID_MOS' ) or die( 'Direct Access to this location is not allowed.' );


//MODULE XML PARAMS
if (defined('_ELXIS_ADMIN')) {
    define('CX_01a', 'тип менија');
	define('CX_01', 'Списак од изборником приказ (одвојене зарезом) Мени');
    define('CX_02', '[Изаберите]');
    define('CX_03', 'Списак менија (не користи за референцу само!)');
    define('CX_04', 'базе');
    define('CX_05', 'Шта би требао бити кориштен као база за сваку мени стабло? опције: прво, мени, модул, страница, текст');
    define('CX_06', 'прво');
    define('CX_07', 'мени');
    define('CX_08', 'модул');
    define('CX_09', 'страница');
    define('CX_10', 'текст');
    define('CX_11', 'баѕни текст');
    define('CX_12', 'Ако је база = текст, текст навести да користе');
    define('CX_13', 'Сепаратор');
    define('CX_14', 'По подразумеваној вредности се приказује један модул.');
    define('CX_15', 'отвори све');
    define('CX_16', 'По подразумеваној вредности мени стабла приказан је са свим директоријумима затворена, осим у једном од одабраних чвор. Помоћу овог параметра све мапе су отворени.');
    define('CX_true', 'Да');
    define('CX_false', 'Не');
    define('CX_17', 'користи изабрани');
    define('CX_18', 'чворови се могу изабрати(highlighted).');
    define('CX_19', 'користи линије');
    define('CX_20', 'Стабло је нацртан са линијама.');
    define('CX_21', 'користи иконице');
    define('CX_22', 'Стабло је нацртано са иконицама.');
    define('CX_23', 'користи статусни текст');
    define('CX_24', 'прикази име чвора у статусном бару уместо као url.');
    define('CX_25', 'затври поднивое');
    define('CX_26', 'само један чвор од родитеља може бити проширен у исто време.');

}
?>